## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                   |
|--------|-----------------------------------------|
| add    | `aws_quicksight_group.dataset_full`     |
| update | `aws_quicksight_data_set.notifications` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_quicksight_data_set.notifications will be updated in-place
  ~ resource "aws_quicksight_data_set" "notifications" {
        id             = "239043911459,notifications"
        name           = "Notifications"
        tags           = {}
        # (6 unchanged attributes hidden)



      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "notifications"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "notifications"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
            }

          + s3_source {
              + data_source_arn = (known after apply)

              + input_columns {
                  + name = (known after apply)
                  + type = (known after apply)
                }

              + upload_settings {
                  + contains_header = (known after apply)
                  + delimiter       = (known after apply)
                  + format          = (known after apply)
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
      - physical_table_map {
          - physical_table_map_id = "notifications" -> null

          - relational_table {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging" -> null
              - name            = "notifications" -> null

              - input_columns {
                  - name = "id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_version" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "service_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "job_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_type" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_status" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "created_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "sent_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "updated_at" -> null
                  - type = "DATETIME" -> null
                }
            }
        }
        # (2 unchanged blocks hidden)
    }

  # aws_quicksight_group.dataset_full will be created
  + resource "aws_quicksight_group" "dataset_full" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + description    = "users with full access to Quicksight data sets"
      + group_name     = "quicksight-dataset-full-access"
      + id             = (known after apply)
      + namespace      = "default"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

25 tests, 17 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
